{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "input_1",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d\/Conv2D1__70",
      "top" : "model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d\/Conv2D1__70:0",
      "type" : "transpose",
      "name" : "model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d\/Conv2D1__70"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 1,
      "top" : "model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d\/Conv2D1",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d\/Conv2D1__70:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d\/Conv2D1",
      "weights" : {
        "params_prelu" : 7
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu\/add;model_1\/model\/p_re_lu\/Relu;model_1\/model\/p_re_lu\/Neg_1;model_1\/model\/p_re_lu\/Relu_1;model_1\/model\/p_re_lu\/mul1",
      "top" : "model_1\/model\/p_re_lu\/add;model_1\/model\/p_re_lu\/Relu;model_1\/model\/p_re_lu\/Neg_1;model_1\/model\/p_re_lu\/Relu_1;model_1\/model\/p_re_lu\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu\/add;model_1\/model\/p_re_lu\/Relu;model_1\/model\/p_re_lu\/Neg_1;model_1\/model\/p_re_lu\/Relu_1;model_1\/model\/p_re_lu\/mul1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d\/depthwise1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/depthwise_conv2d\/depthwise1",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "model_1\/model\/depthwise_conv2d\/depthwise1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model_1\/model\/p_re_lu\/add;model_1\/model\/p_re_lu\/Relu;model_1\/model\/p_re_lu\/Neg_1;model_1\/model\/p_re_lu\/Relu_1;model_1\/model\/p_re_lu\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_1\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_1\/Conv2D1",
      "blob_weights" : 15,
      "K" : 32,
      "blob_biases" : 13,
      "name" : "model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_1\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model_1\/model\/depthwise_conv2d\/depthwise1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/p_re_lu\/add;model_1\/model\/p_re_lu\/Relu;model_1\/model\/p_re_lu\/Neg_1;model_1\/model\/p_re_lu\/Relu_1;model_1\/model\/p_re_lu\/mul1,model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_1\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add\/add",
      "weights" : {
        "params_prelu" : 19
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_1\/add;model_1\/model\/p_re_lu_1\/Relu;model_1\/model\/p_re_lu_1\/Neg_1;model_1\/model\/p_re_lu_1\/Relu_1;model_1\/model\/p_re_lu_1\/mul1",
      "top" : "model_1\/model\/p_re_lu_1\/add;model_1\/model\/p_re_lu_1\/Relu;model_1\/model\/p_re_lu_1\/Neg_1;model_1\/model\/p_re_lu_1\/Relu_1;model_1\/model\/p_re_lu_1\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_1\/add;model_1\/model\/p_re_lu_1\/Relu;model_1\/model\/p_re_lu_1\/Neg_1;model_1\/model\/p_re_lu_1\/Relu_1;model_1\/model\/p_re_lu_1\/mul1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_1\/depthwise1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/depthwise_conv2d_1\/depthwise1",
      "blob_weights" : 23,
      "K" : 32,
      "blob_biases" : 21,
      "name" : "model_1\/model\/depthwise_conv2d_1\/depthwise1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model_1\/model\/p_re_lu_1\/add;model_1\/model\/p_re_lu_1\/Relu;model_1\/model\/p_re_lu_1\/Neg_1;model_1\/model\/p_re_lu_1\/Relu_1;model_1\/model\/p_re_lu_1\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_2\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_2\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_2\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_2\/Conv2D1",
      "blob_weights" : 27,
      "K" : 32,
      "blob_biases" : 25,
      "name" : "model_1\/model\/batch_normalization_2\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_2\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model_1\/model\/depthwise_conv2d_1\/depthwise1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/p_re_lu_1\/add;model_1\/model\/p_re_lu_1\/Relu;model_1\/model\/p_re_lu_1\/Neg_1;model_1\/model\/p_re_lu_1\/Relu_1;model_1\/model\/p_re_lu_1\/mul1,model_1\/model\/batch_normalization_2\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_2\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_1\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_1\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_1\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add_1\/add",
      "weights" : {
        "params_prelu" : 31
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_2\/add;model_1\/model\/p_re_lu_2\/Relu;model_1\/model\/p_re_lu_2\/Neg_1;model_1\/model\/p_re_lu_2\/Relu_1;model_1\/model\/p_re_lu_2\/mul1",
      "top" : "model_1\/model\/p_re_lu_2\/add;model_1\/model\/p_re_lu_2\/Relu;model_1\/model\/p_re_lu_2\/Neg_1;model_1\/model\/p_re_lu_2\/Relu_1;model_1\/model\/p_re_lu_2\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_2\/add;model_1\/model\/p_re_lu_2\/Relu;model_1\/model\/p_re_lu_2\/Neg_1;model_1\/model\/p_re_lu_2\/Relu_1;model_1\/model\/p_re_lu_2\/mul1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_2\/depthwise1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/depthwise_conv2d_2\/depthwise1",
      "blob_weights" : 35,
      "K" : 32,
      "blob_biases" : 33,
      "name" : "model_1\/model\/depthwise_conv2d_2\/depthwise1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model_1\/model\/p_re_lu_2\/add;model_1\/model\/p_re_lu_2\/Relu;model_1\/model\/p_re_lu_2\/Neg_1;model_1\/model\/p_re_lu_2\/Relu_1;model_1\/model\/p_re_lu_2\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_3\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_3\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_3\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_3\/Conv2D1",
      "blob_weights" : 39,
      "K" : 32,
      "blob_biases" : 37,
      "name" : "model_1\/model\/batch_normalization_3\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_3\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model_1\/model\/depthwise_conv2d_2\/depthwise1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/p_re_lu_2\/add;model_1\/model\/p_re_lu_2\/Relu;model_1\/model\/p_re_lu_2\/Neg_1;model_1\/model\/p_re_lu_2\/Relu_1;model_1\/model\/p_re_lu_2\/mul1,model_1\/model\/batch_normalization_3\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_3\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_2\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_2\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_2\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add_2\/add",
      "weights" : {
        "params_prelu" : 43
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_3\/add;model_1\/model\/p_re_lu_3\/Relu;model_1\/model\/p_re_lu_3\/Neg_1;model_1\/model\/p_re_lu_3\/Relu_1;model_1\/model\/p_re_lu_3\/mul1",
      "top" : "model_1\/model\/p_re_lu_3\/add;model_1\/model\/p_re_lu_3\/Relu;model_1\/model\/p_re_lu_3\/Neg_1;model_1\/model\/p_re_lu_3\/Relu_1;model_1\/model\/p_re_lu_3\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_3\/add;model_1\/model\/p_re_lu_3\/Relu;model_1\/model\/p_re_lu_3\/Neg_1;model_1\/model\/p_re_lu_3\/Relu_1;model_1\/model\/p_re_lu_3\/mul1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_3\/depthwise1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/depthwise_conv2d_3\/depthwise1",
      "blob_weights" : 47,
      "K" : 32,
      "blob_biases" : 45,
      "name" : "model_1\/model\/depthwise_conv2d_3\/depthwise1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model_1\/model\/p_re_lu_3\/add;model_1\/model\/p_re_lu_3\/Relu;model_1\/model\/p_re_lu_3\/Neg_1;model_1\/model\/p_re_lu_3\/Relu_1;model_1\/model\/p_re_lu_3\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_4\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_4\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_4\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_4\/Conv2D1",
      "blob_weights" : 51,
      "K" : 32,
      "blob_biases" : 49,
      "name" : "model_1\/model\/batch_normalization_4\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_4\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model_1\/model\/depthwise_conv2d_3\/depthwise1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/p_re_lu_3\/add;model_1\/model\/p_re_lu_3\/Relu;model_1\/model\/p_re_lu_3\/Neg_1;model_1\/model\/p_re_lu_3\/Relu_1;model_1\/model\/p_re_lu_3\/mul1,model_1\/model\/batch_normalization_4\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_4\/depthwise;model_1\/model\/conv2d_4\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_3\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_3\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_3\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add_3\/add",
      "weights" : {
        "params_prelu" : 55
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_4\/add;model_1\/model\/p_re_lu_4\/Relu;model_1\/model\/p_re_lu_4\/Neg_1;model_1\/model\/p_re_lu_4\/Relu_1;model_1\/model\/p_re_lu_4\/mul1",
      "top" : "model_1\/model\/p_re_lu_4\/add;model_1\/model\/p_re_lu_4\/Relu;model_1\/model\/p_re_lu_4\/Neg_1;model_1\/model\/p_re_lu_4\/Relu_1;model_1\/model\/p_re_lu_4\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_4\/add;model_1\/model\/p_re_lu_4\/Relu;model_1\/model\/p_re_lu_4\/Neg_1;model_1\/model\/p_re_lu_4\/Relu_1;model_1\/model\/p_re_lu_4\/mul1"
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/model\/max_pooling2d\/MaxPool",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/model\/max_pooling2d\/MaxPool",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/model\/max_pooling2d\/MaxPool",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/model\/p_re_lu_4\/add;model_1\/model\/p_re_lu_4\/Relu;model_1\/model\/p_re_lu_4\/Neg_1;model_1\/model\/p_re_lu_4\/Relu_1;model_1\/model\/p_re_lu_4\/mul1",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pads_0" : 0,
      "top" : "model_1\/model\/channel_padding\/Pad",
      "debug_info" : "model_1\/model\/channel_padding\/Pad",
      "pads_2" : 0,
      "pads_4" : 0,
      "type" : "tensor_zero_pad",
      "pads_6" : 0,
      "pads_8" : 0,
      "pads_10" : 0,
      "value" : 0,
      "pads_11" : 0,
      "pads_12" : 0,
      "pads_13" : 0,
      "pads_20" : 0,
      "pads_14" : 0,
      "name" : "model_1\/model\/channel_padding\/Pad",
      "pads_22" : 0,
      "pads_21" : 0,
      "pads_23" : 0,
      "nd_mode" : true,
      "pads_24" : 0,
      "pads_17" : 0,
      "pads_32" : 0,
      "pads_18" : 0,
      "pads_33" : 0,
      "pads_19" : 0,
      "pads_34" : 0,
      "pads_27" : 0,
      "pads_28" : 0,
      "pads_42" : 0,
      "pads_43" : 0,
      "pads_29" : 0,
      "pads_37" : 0,
      "pads_41" : 0,
      "pads_38" : 0,
      "pads_31" : 0,
      "pads_39" : 0,
      "pads_36" : 0,
      "pads_40" : 0,
      "pads_26" : 0,
      "pads_16" : 0,
      "pads_30" : 0,
      "pads_45" : 0,
      "pads_35" : 0,
      "pads_25" : 0,
      "pads_15" : 0,
      "pads_1" : 0,
      "pads_44" : 0,
      "pads_46" : 0,
      "pads_3" : 32,
      "pads_47" : 0,
      "pads_48" : 0,
      "pads_5" : 0,
      "pads_49" : 0,
      "pads_50" : 0,
      "pads_7" : 0,
      "pads_51" : 0,
      "pads_52" : 0,
      "pads_9" : 0,
      "pads_53" : 0,
      "pads_54" : 0,
      "pads_55" : 0,
      "pads_56" : 0,
      "pads_57" : 0,
      "pads_58" : 0,
      "pads_59" : 0,
      "pads_60" : 0,
      "pads_61" : 0,
      "pads_62" : 0,
      "pads_63" : 0,
      "weights" : {

      },
      "bottom" : "model_1\/model\/max_pooling2d\/MaxPool"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_4\/depthwise2",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 1,
      "top" : "model_1\/model\/depthwise_conv2d_4\/depthwise2",
      "blob_weights" : 59,
      "K" : 32,
      "blob_biases" : 57,
      "stride_x" : 2,
      "name" : "model_1\/model\/depthwise_conv2d_4\/depthwise2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "model_1\/model\/p_re_lu_4\/add;model_1\/model\/p_re_lu_4\/Relu;model_1\/model\/p_re_lu_4\/Neg_1;model_1\/model\/p_re_lu_4\/Relu_1;model_1\/model\/p_re_lu_4\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_5\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_5\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_5\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_5\/Conv2D1",
      "blob_weights" : 63,
      "K" : 32,
      "blob_biases" : 61,
      "name" : "model_1\/model\/batch_normalization_5\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_5\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/model\/depthwise_conv2d_4\/depthwise2",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/channel_padding\/Pad,model_1\/model\/batch_normalization_5\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_5\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_4\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_4\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_4\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add_4\/add",
      "weights" : {
        "params_prelu" : 67
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_5\/add;model_1\/model\/p_re_lu_5\/Relu;model_1\/model\/p_re_lu_5\/Neg_1;model_1\/model\/p_re_lu_5\/Relu_1;model_1\/model\/p_re_lu_5\/mul1",
      "top" : "model_1\/model\/p_re_lu_5\/add;model_1\/model\/p_re_lu_5\/Relu;model_1\/model\/p_re_lu_5\/Neg_1;model_1\/model\/p_re_lu_5\/Relu_1;model_1\/model\/p_re_lu_5\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_5\/add;model_1\/model\/p_re_lu_5\/Relu;model_1\/model\/p_re_lu_5\/Neg_1;model_1\/model\/p_re_lu_5\/Relu_1;model_1\/model\/p_re_lu_5\/mul1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_5\/depthwise1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/depthwise_conv2d_5\/depthwise1",
      "blob_weights" : 71,
      "K" : 64,
      "blob_biases" : 69,
      "name" : "model_1\/model\/depthwise_conv2d_5\/depthwise1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/model\/p_re_lu_5\/add;model_1\/model\/p_re_lu_5\/Relu;model_1\/model\/p_re_lu_5\/Neg_1;model_1\/model\/p_re_lu_5\/Relu_1;model_1\/model\/p_re_lu_5\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_6\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_6\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_6\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_6\/Conv2D1",
      "blob_weights" : 75,
      "K" : 64,
      "blob_biases" : 73,
      "name" : "model_1\/model\/batch_normalization_6\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_6\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/model\/depthwise_conv2d_5\/depthwise1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/p_re_lu_5\/add;model_1\/model\/p_re_lu_5\/Relu;model_1\/model\/p_re_lu_5\/Neg_1;model_1\/model\/p_re_lu_5\/Relu_1;model_1\/model\/p_re_lu_5\/mul1,model_1\/model\/batch_normalization_6\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_6\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_5\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_5\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_5\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add_5\/add",
      "weights" : {
        "params_prelu" : 79
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_6\/add;model_1\/model\/p_re_lu_6\/Relu;model_1\/model\/p_re_lu_6\/Neg_1;model_1\/model\/p_re_lu_6\/Relu_1;model_1\/model\/p_re_lu_6\/mul1",
      "top" : "model_1\/model\/p_re_lu_6\/add;model_1\/model\/p_re_lu_6\/Relu;model_1\/model\/p_re_lu_6\/Neg_1;model_1\/model\/p_re_lu_6\/Relu_1;model_1\/model\/p_re_lu_6\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_6\/add;model_1\/model\/p_re_lu_6\/Relu;model_1\/model\/p_re_lu_6\/Neg_1;model_1\/model\/p_re_lu_6\/Relu_1;model_1\/model\/p_re_lu_6\/mul1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_6\/depthwise1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/depthwise_conv2d_6\/depthwise1",
      "blob_weights" : 83,
      "K" : 64,
      "blob_biases" : 81,
      "name" : "model_1\/model\/depthwise_conv2d_6\/depthwise1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/model\/p_re_lu_6\/add;model_1\/model\/p_re_lu_6\/Relu;model_1\/model\/p_re_lu_6\/Neg_1;model_1\/model\/p_re_lu_6\/Relu_1;model_1\/model\/p_re_lu_6\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_7\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_7\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_7\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_7\/Conv2D1",
      "blob_weights" : 87,
      "K" : 64,
      "blob_biases" : 85,
      "name" : "model_1\/model\/batch_normalization_7\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_7\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/model\/depthwise_conv2d_6\/depthwise1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/p_re_lu_6\/add;model_1\/model\/p_re_lu_6\/Relu;model_1\/model\/p_re_lu_6\/Neg_1;model_1\/model\/p_re_lu_6\/Relu_1;model_1\/model\/p_re_lu_6\/mul1,model_1\/model\/batch_normalization_7\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_7\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_6\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_6\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_6\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add_6\/add",
      "weights" : {
        "params_prelu" : 91
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_7\/add;model_1\/model\/p_re_lu_7\/Relu;model_1\/model\/p_re_lu_7\/Neg_1;model_1\/model\/p_re_lu_7\/Relu_1;model_1\/model\/p_re_lu_7\/mul1",
      "top" : "model_1\/model\/p_re_lu_7\/add;model_1\/model\/p_re_lu_7\/Relu;model_1\/model\/p_re_lu_7\/Neg_1;model_1\/model\/p_re_lu_7\/Relu_1;model_1\/model\/p_re_lu_7\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_7\/add;model_1\/model\/p_re_lu_7\/Relu;model_1\/model\/p_re_lu_7\/Neg_1;model_1\/model\/p_re_lu_7\/Relu_1;model_1\/model\/p_re_lu_7\/mul1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_7\/depthwise1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/depthwise_conv2d_7\/depthwise1",
      "blob_weights" : 95,
      "K" : 64,
      "blob_biases" : 93,
      "name" : "model_1\/model\/depthwise_conv2d_7\/depthwise1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/model\/p_re_lu_7\/add;model_1\/model\/p_re_lu_7\/Relu;model_1\/model\/p_re_lu_7\/Neg_1;model_1\/model\/p_re_lu_7\/Relu_1;model_1\/model\/p_re_lu_7\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_8\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_8\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_8\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_8\/Conv2D1",
      "blob_weights" : 99,
      "K" : 64,
      "blob_biases" : 97,
      "name" : "model_1\/model\/batch_normalization_8\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_8\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/model\/depthwise_conv2d_7\/depthwise1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/p_re_lu_7\/add;model_1\/model\/p_re_lu_7\/Relu;model_1\/model\/p_re_lu_7\/Neg_1;model_1\/model\/p_re_lu_7\/Relu_1;model_1\/model\/p_re_lu_7\/mul1,model_1\/model\/batch_normalization_8\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_8\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_7\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_7\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_7\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add_7\/add",
      "weights" : {
        "params_prelu" : 103
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_8\/add;model_1\/model\/p_re_lu_8\/Relu;model_1\/model\/p_re_lu_8\/Neg_1;model_1\/model\/p_re_lu_8\/Relu_1;model_1\/model\/p_re_lu_8\/mul1",
      "top" : "model_1\/model\/p_re_lu_8\/add;model_1\/model\/p_re_lu_8\/Relu;model_1\/model\/p_re_lu_8\/Neg_1;model_1\/model\/p_re_lu_8\/Relu_1;model_1\/model\/p_re_lu_8\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_8\/add;model_1\/model\/p_re_lu_8\/Relu;model_1\/model\/p_re_lu_8\/Neg_1;model_1\/model\/p_re_lu_8\/Relu_1;model_1\/model\/p_re_lu_8\/mul1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_8\/depthwise1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/depthwise_conv2d_8\/depthwise1",
      "blob_weights" : 107,
      "K" : 64,
      "blob_biases" : 105,
      "name" : "model_1\/model\/depthwise_conv2d_8\/depthwise1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/model\/p_re_lu_8\/add;model_1\/model\/p_re_lu_8\/Relu;model_1\/model\/p_re_lu_8\/Neg_1;model_1\/model\/p_re_lu_8\/Relu_1;model_1\/model\/p_re_lu_8\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_9\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_9\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_9\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_9\/Conv2D1",
      "blob_weights" : 111,
      "K" : 64,
      "blob_biases" : 109,
      "name" : "model_1\/model\/batch_normalization_9\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_9\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/model\/depthwise_conv2d_8\/depthwise1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/p_re_lu_8\/add;model_1\/model\/p_re_lu_8\/Relu;model_1\/model\/p_re_lu_8\/Neg_1;model_1\/model\/p_re_lu_8\/Relu_1;model_1\/model\/p_re_lu_8\/mul1,model_1\/model\/batch_normalization_9\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_9\/depthwise;model_1\/model\/conv2d_9\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_8\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_8\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_8\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add_8\/add",
      "weights" : {
        "params_prelu" : 115
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_9\/add;model_1\/model\/p_re_lu_9\/Relu;model_1\/model\/p_re_lu_9\/Neg_1;model_1\/model\/p_re_lu_9\/Relu_1;model_1\/model\/p_re_lu_9\/mul1",
      "top" : "model_1\/model\/p_re_lu_9\/add;model_1\/model\/p_re_lu_9\/Relu;model_1\/model\/p_re_lu_9\/Neg_1;model_1\/model\/p_re_lu_9\/Relu_1;model_1\/model\/p_re_lu_9\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_9\/add;model_1\/model\/p_re_lu_9\/Relu;model_1\/model\/p_re_lu_9\/Neg_1;model_1\/model\/p_re_lu_9\/Relu_1;model_1\/model\/p_re_lu_9\/mul1"
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/model\/max_pooling2d_1\/MaxPool",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/model\/max_pooling2d_1\/MaxPool",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/model\/max_pooling2d_1\/MaxPool",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/model\/p_re_lu_9\/add;model_1\/model\/p_re_lu_9\/Relu;model_1\/model\/p_re_lu_9\/Neg_1;model_1\/model\/p_re_lu_9\/Relu_1;model_1\/model\/p_re_lu_9\/mul1",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pads_0" : 0,
      "top" : "model_1\/model\/channel_padding_1\/Pad",
      "debug_info" : "model_1\/model\/channel_padding_1\/Pad",
      "pads_2" : 0,
      "pads_4" : 0,
      "type" : "tensor_zero_pad",
      "pads_6" : 0,
      "pads_8" : 0,
      "pads_10" : 0,
      "value" : 0,
      "pads_11" : 0,
      "pads_12" : 0,
      "pads_13" : 0,
      "pads_20" : 0,
      "pads_14" : 0,
      "name" : "model_1\/model\/channel_padding_1\/Pad",
      "pads_22" : 0,
      "pads_21" : 0,
      "pads_23" : 0,
      "nd_mode" : true,
      "pads_24" : 0,
      "pads_17" : 0,
      "pads_32" : 0,
      "pads_18" : 0,
      "pads_33" : 0,
      "pads_19" : 0,
      "pads_34" : 0,
      "pads_27" : 0,
      "pads_28" : 0,
      "pads_42" : 0,
      "pads_43" : 0,
      "pads_29" : 0,
      "pads_37" : 0,
      "pads_41" : 0,
      "pads_38" : 0,
      "pads_31" : 0,
      "pads_39" : 0,
      "pads_36" : 0,
      "pads_40" : 0,
      "pads_26" : 0,
      "pads_16" : 0,
      "pads_30" : 0,
      "pads_45" : 0,
      "pads_35" : 0,
      "pads_25" : 0,
      "pads_15" : 0,
      "pads_1" : 0,
      "pads_44" : 0,
      "pads_46" : 0,
      "pads_3" : 64,
      "pads_47" : 0,
      "pads_48" : 0,
      "pads_5" : 0,
      "pads_49" : 0,
      "pads_50" : 0,
      "pads_7" : 0,
      "pads_51" : 0,
      "pads_52" : 0,
      "pads_9" : 0,
      "pads_53" : 0,
      "pads_54" : 0,
      "pads_55" : 0,
      "pads_56" : 0,
      "pads_57" : 0,
      "pads_58" : 0,
      "pads_59" : 0,
      "pads_60" : 0,
      "pads_61" : 0,
      "pads_62" : 0,
      "pads_63" : 0,
      "weights" : {

      },
      "bottom" : "model_1\/model\/max_pooling2d_1\/MaxPool"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_9\/depthwise2",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 1,
      "top" : "model_1\/model\/depthwise_conv2d_9\/depthwise2",
      "blob_weights" : 119,
      "K" : 64,
      "blob_biases" : 117,
      "stride_x" : 2,
      "name" : "model_1\/model\/depthwise_conv2d_9\/depthwise2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/model\/p_re_lu_9\/add;model_1\/model\/p_re_lu_9\/Relu;model_1\/model\/p_re_lu_9\/Neg_1;model_1\/model\/p_re_lu_9\/Relu_1;model_1\/model\/p_re_lu_9\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_10\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_10\/Conv2D1",
      "blob_weights" : 123,
      "K" : 64,
      "blob_biases" : 121,
      "name" : "model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_10\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "model_1\/model\/depthwise_conv2d_9\/depthwise2",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/channel_padding_1\/Pad,model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_10\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_9\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_9\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_9\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add_9\/add",
      "weights" : {
        "params_prelu" : 127
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_10\/add;model_1\/model\/p_re_lu_10\/Relu;model_1\/model\/p_re_lu_10\/Neg_1;model_1\/model\/p_re_lu_10\/Relu_1;model_1\/model\/p_re_lu_10\/mul1",
      "top" : "model_1\/model\/p_re_lu_10\/add;model_1\/model\/p_re_lu_10\/Relu;model_1\/model\/p_re_lu_10\/Neg_1;model_1\/model\/p_re_lu_10\/Relu_1;model_1\/model\/p_re_lu_10\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_10\/add;model_1\/model\/p_re_lu_10\/Relu;model_1\/model\/p_re_lu_10\/Neg_1;model_1\/model\/p_re_lu_10\/Relu_1;model_1\/model\/p_re_lu_10\/mul1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_10\/depthwise1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/depthwise_conv2d_10\/depthwise1",
      "blob_weights" : 131,
      "K" : 128,
      "blob_biases" : 129,
      "name" : "model_1\/model\/depthwise_conv2d_10\/depthwise1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "model_1\/model\/p_re_lu_10\/add;model_1\/model\/p_re_lu_10\/Relu;model_1\/model\/p_re_lu_10\/Neg_1;model_1\/model\/p_re_lu_10\/Relu_1;model_1\/model\/p_re_lu_10\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_11\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_11\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_11\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_11\/Conv2D1",
      "blob_weights" : 135,
      "K" : 128,
      "blob_biases" : 133,
      "name" : "model_1\/model\/batch_normalization_11\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_11\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "model_1\/model\/depthwise_conv2d_10\/depthwise1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/p_re_lu_10\/add;model_1\/model\/p_re_lu_10\/Relu;model_1\/model\/p_re_lu_10\/Neg_1;model_1\/model\/p_re_lu_10\/Relu_1;model_1\/model\/p_re_lu_10\/mul1,model_1\/model\/batch_normalization_11\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_11\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_10\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_10\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_10\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add_10\/add",
      "weights" : {
        "params_prelu" : 139
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_11\/add;model_1\/model\/p_re_lu_11\/Relu;model_1\/model\/p_re_lu_11\/Neg_1;model_1\/model\/p_re_lu_11\/Relu_1;model_1\/model\/p_re_lu_11\/mul1",
      "top" : "model_1\/model\/p_re_lu_11\/add;model_1\/model\/p_re_lu_11\/Relu;model_1\/model\/p_re_lu_11\/Neg_1;model_1\/model\/p_re_lu_11\/Relu_1;model_1\/model\/p_re_lu_11\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_11\/add;model_1\/model\/p_re_lu_11\/Relu;model_1\/model\/p_re_lu_11\/Neg_1;model_1\/model\/p_re_lu_11\/Relu_1;model_1\/model\/p_re_lu_11\/mul1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_11\/depthwise1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/depthwise_conv2d_11\/depthwise1",
      "blob_weights" : 143,
      "K" : 128,
      "blob_biases" : 141,
      "name" : "model_1\/model\/depthwise_conv2d_11\/depthwise1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "model_1\/model\/p_re_lu_11\/add;model_1\/model\/p_re_lu_11\/Relu;model_1\/model\/p_re_lu_11\/Neg_1;model_1\/model\/p_re_lu_11\/Relu_1;model_1\/model\/p_re_lu_11\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_12\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_12\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_12\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_12\/Conv2D1",
      "blob_weights" : 147,
      "K" : 128,
      "blob_biases" : 145,
      "name" : "model_1\/model\/batch_normalization_12\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_12\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "model_1\/model\/depthwise_conv2d_11\/depthwise1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/p_re_lu_11\/add;model_1\/model\/p_re_lu_11\/Relu;model_1\/model\/p_re_lu_11\/Neg_1;model_1\/model\/p_re_lu_11\/Relu_1;model_1\/model\/p_re_lu_11\/mul1,model_1\/model\/batch_normalization_12\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_12\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_11\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_11\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_11\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add_11\/add",
      "weights" : {
        "params_prelu" : 151
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_12\/add;model_1\/model\/p_re_lu_12\/Relu;model_1\/model\/p_re_lu_12\/Neg_1;model_1\/model\/p_re_lu_12\/Relu_1;model_1\/model\/p_re_lu_12\/mul1",
      "top" : "model_1\/model\/p_re_lu_12\/add;model_1\/model\/p_re_lu_12\/Relu;model_1\/model\/p_re_lu_12\/Neg_1;model_1\/model\/p_re_lu_12\/Relu_1;model_1\/model\/p_re_lu_12\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_12\/add;model_1\/model\/p_re_lu_12\/Relu;model_1\/model\/p_re_lu_12\/Neg_1;model_1\/model\/p_re_lu_12\/Relu_1;model_1\/model\/p_re_lu_12\/mul1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_12\/depthwise1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/depthwise_conv2d_12\/depthwise1",
      "blob_weights" : 155,
      "K" : 128,
      "blob_biases" : 153,
      "name" : "model_1\/model\/depthwise_conv2d_12\/depthwise1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "model_1\/model\/p_re_lu_12\/add;model_1\/model\/p_re_lu_12\/Relu;model_1\/model\/p_re_lu_12\/Neg_1;model_1\/model\/p_re_lu_12\/Relu_1;model_1\/model\/p_re_lu_12\/mul1",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_13\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_13\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_13\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_13\/Conv2D1",
      "blob_weights" : 159,
      "K" : 128,
      "blob_biases" : 157,
      "name" : "model_1\/model\/batch_normalization_13\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_13\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "model_1\/model\/depthwise_conv2d_12\/depthwise1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/p_re_lu_12\/add;model_1\/model\/p_re_lu_12\/Relu;model_1\/model\/p_re_lu_12\/Neg_1;model_1\/model\/p_re_lu_12\/Relu_1;model_1\/model\/p_re_lu_12\/mul1,model_1\/model\/batch_normalization_13\/FusedBatchNormV3;model_1\/model\/conv2d_30\/Conv2D;model_1\/model\/conv2d_13\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_12\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_12\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_12\/add",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/model\/add_12\/add",
      "weights" : {
        "params_prelu" : 163
      },
      "mode" : 4,
      "debug_info" : "model_1\/model\/p_re_lu_13\/add;model_1\/model\/p_re_lu_13\/Relu;model_1\/model\/p_re_lu_13\/Neg_1;model_1\/model\/p_re_lu_13\/Relu_1;model_1\/model\/p_re_lu_13\/mul1",
      "top" : "model_1\/model\/p_re_lu_13\/add;model_1\/model\/p_re_lu_13\/Relu;model_1\/model\/p_re_lu_13\/Neg_1;model_1\/model\/p_re_lu_13\/Relu_1;model_1\/model\/p_re_lu_13\/mul1",
      "type" : "activation",
      "name" : "model_1\/model\/p_re_lu_13\/add;model_1\/model\/p_re_lu_13\/Relu;model_1\/model\/p_re_lu_13\/Neg_1;model_1\/model\/p_re_lu_13\/Relu_1;model_1\/model\/p_re_lu_13\/mul1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/depthwise_conv2d_13\/depthwise1",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/depthwise_conv2d_13\/depthwise1",
      "blob_weights" : 167,
      "K" : 128,
      "blob_biases" : 165,
      "name" : "model_1\/model\/depthwise_conv2d_13\/depthwise1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 128,
