<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/analytics/coremldata.bin</key>
		<data>
		MBw4xOb4Ip/aEjopYaQMrYwCWRs=
		</data>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/coremldata.bin</key>
		<data>
		ROjLS7ho4zTnCX8wGCPPAfyKR54=
		</data>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/metadata.json</key>
		<data>
		MeFtiv6XfgOXS3by4jSZrP93Bcs=
		</data>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/model.espresso.net</key>
		<data>
		TD8TIWJa4W+BrraCaoEKuw+Vlis=
		</data>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/model.espresso.shape</key>
		<data>
		6canO3Qx5h91DSE4QuvbJr3E4KI=
		</data>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/model.espresso.weights</key>
		<data>
		98Os1vKiLfnjfJckncvlWp8OieQ=
		</data>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/analytics/coremldata.bin</key>
		<data>
		CvawN8RqW7c2JkrAQOvUjbRiqeI=
		</data>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/coremldata.bin</key>
		<data>
		HKVqPK2hCYy0enxlS0P1NpQuXkk=
		</data>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/metadata.json</key>
		<data>
		ZtpxEh549wKBmGnpoIhLDd5idqg=
		</data>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/model.espresso.net</key>
		<data>
		anYdlksAoQoo/3aoBQUKyJqTzz4=
		</data>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/model.espresso.shape</key>
		<data>
		phLkFDCpgah6GdeEOwsAjNGq4Hk=
		</data>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/model.espresso.weights</key>
		<data>
		GKszGtSy3BzINkqx1+lUAoyz6TQ=
		</data>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>MacOS/libopencv_world.4.5.4.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			VHzsoS6NqcPBcXaurd+nTeVnn2E=
			</data>
			<key>requirement</key>
			<string>identifier "libopencv_world.4" and anchor apple generic and certificate leaf[subject.CN] = "Apple Development: Evangelos Pterneas (M5YPDKDD33)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			VIiD7DpAqlxMGpA+o+6J7ooLQcMoA95pVD2ulxuEkn4=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			UxUGW0exuBprE08DBXhMc2SqVvo1uxzyXpVJ681zfvE=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			+nPHZtTGC7eYYM8/QIvio9LIIpl0vg2wYXmYSgn0cNE=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			574D9Wyh3wS+RmmDtkME5gXUe26swOFQkZlJcaYbfzk=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			+TPvQLtoP/nHcf1qaLZxo854CoYJDtIaPo3Fx0mrtPI=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			rG2vBtYF82ls0Eebv/kQj3KphSuahNoy2VLgsGu0XDY=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Hand.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			0c343gf/M+5mlJCfA8mtZJChGN0IxXvAD6+jHcQA5IE=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			eyd1HSwocUazoFXntZXn1vDqSD6wrqikDhUFwCnIdzI=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			TFaQpb4VI5f18N2+OfFcLd0Nxc8xDvzXgr1m73A5E0I=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			xKkWYtw64XB6rkWZOBYApLpKhboMFieZTt+mkbxHjmw=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			gGtrrTDCnxyuiaJOxvH3KnKDR6T7DJQazm/hDRDacAc=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			Rwx8kXy2+jvBEkhGaJz1+FLLfv1vdM8ZWFoen3kxYSc=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>Resources/LightBuzz_Model_Palm.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^Resources/</key>
		<true/>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^(Frameworks|SharedFrameworks|PlugIns|Plug-ins|XPCServices|Helpers|MacOS|Library/(Automator|Spotlight|LoginItems))/</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^[^/]+$</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
