{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "input_1",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "model_1\/model\/re_lu\/Relu6;model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d\/depthwise;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d\/Conv2D__102",
      "top" : "model_1\/model\/re_lu\/Relu6;model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d\/depthwise;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d\/Conv2D__102:0",
      "type" : "transpose",
      "name" : "model_1\/model\/re_lu\/Relu6;model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d\/depthwise;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d\/Conv2D__102"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu\/Relu6;model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d\/depthwise;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu\/Relu6;model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d\/depthwise;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d\/Conv2D",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "model_1\/model\/re_lu\/Relu6;model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d\/depthwise;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "model_1\/model\/re_lu\/Relu6;model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d\/depthwise;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d\/Conv2D__102:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu\/Relu6;model_1\/model\/batch_normalization\/FusedBatchNormV3;model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d\/depthwise;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d\/Conv2D",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__11",
      "top" : "Relu6__11:0",
      "type" : "elementwise",
      "name" : "Relu6__11",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_1\/Relu6;model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d\/depthwise;model_1\/model\/conv2d_5\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "model_1\/model\/re_lu_1\/Relu6;model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d\/depthwise;model_1\/model\/conv2d_5\/Conv2D",
      "blob_weights" : 7,
      "K" : 24,
      "blob_biases" : 5,
      "name" : "model_1\/model\/re_lu_1\/Relu6;model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d\/depthwise;model_1\/model\/conv2d_5\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 24,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "Relu6__11:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_1\/Relu6;model_1\/model\/batch_normalization_1\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d\/depthwise;model_1\/model\/conv2d_5\/Conv2D",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__13",
      "top" : "Relu6__13:0",
      "type" : "elementwise",
      "name" : "Relu6__13",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_2\/FusedBatchNormV3;model_1\/model\/conv2d_1\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_2\/FusedBatchNormV3;model_1\/model\/conv2d_1\/Conv2D1",
      "blob_weights" : 11,
      "K" : 24,
      "blob_biases" : 9,
      "name" : "model_1\/model\/batch_normalization_2\/FusedBatchNormV3;model_1\/model\/conv2d_1\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "Relu6__13:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_2\/Relu6;model_1\/model\/batch_normalization_3\/FusedBatchNormV3;model_1\/model\/batch_normalization_4\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_1\/depthwise;model_1\/model\/conv2d_2\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu_2\/Relu6;model_1\/model\/batch_normalization_3\/FusedBatchNormV3;model_1\/model\/batch_normalization_4\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_1\/depthwise;model_1\/model\/conv2d_2\/Conv2D",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "name" : "model_1\/model\/re_lu_2\/Relu6;model_1\/model\/batch_normalization_3\/FusedBatchNormV3;model_1\/model\/batch_normalization_4\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_1\/depthwise;model_1\/model\/conv2d_2\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/model\/batch_normalization_2\/FusedBatchNormV3;model_1\/model\/conv2d_1\/Conv2D1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_2\/Relu6;model_1\/model\/batch_normalization_3\/FusedBatchNormV3;model_1\/model\/batch_normalization_4\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_1\/depthwise;model_1\/model\/conv2d_2\/Conv2D",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__16",
      "top" : "Relu6__16:0",
      "type" : "elementwise",
      "name" : "Relu6__16",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_3\/Relu6;model_1\/model\/batch_normalization_4\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_1\/depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu_3\/Relu6;model_1\/model\/batch_normalization_4\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_1\/depthwise",
      "blob_weights" : 19,
      "K" : 64,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "model_1\/model\/re_lu_3\/Relu6;model_1\/model\/batch_normalization_4\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_1\/depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "Relu6__16:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_3\/Relu6;model_1\/model\/batch_normalization_4\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_1\/depthwise",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__18",
      "top" : "Relu6__18:0",
      "type" : "elementwise",
      "name" : "Relu6__18",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_5\/FusedBatchNormV3;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d_3\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_5\/FusedBatchNormV3;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d_3\/Conv2D1",
      "blob_weights" : 23,
      "K" : 64,
      "blob_biases" : 21,
      "name" : "model_1\/model\/batch_normalization_5\/FusedBatchNormV3;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d_3\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "Relu6__18:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_4\/Relu6;model_1\/model\/batch_normalization_6\/FusedBatchNormV3;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise;model_1\/model\/conv2d_4\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu_4\/Relu6;model_1\/model\/batch_normalization_6\/FusedBatchNormV3;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise;model_1\/model\/conv2d_4\/Conv2D",
      "blob_weights" : 27,
      "K" : 24,
      "blob_biases" : 25,
      "name" : "model_1\/model\/re_lu_4\/Relu6;model_1\/model\/batch_normalization_6\/FusedBatchNormV3;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise;model_1\/model\/conv2d_4\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "model_1\/model\/batch_normalization_5\/FusedBatchNormV3;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d_3\/Conv2D1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_4\/Relu6;model_1\/model\/batch_normalization_6\/FusedBatchNormV3;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise;model_1\/model\/conv2d_4\/Conv2D",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__21",
      "top" : "Relu6__21:0",
      "type" : "elementwise",
      "name" : "Relu6__21",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_5\/Relu6;model_1\/model\/batch_normalization_7\/FusedBatchNormV3;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise;model_1\/model\/depthwise_conv2d_2\/depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "model_1\/model\/re_lu_5\/Relu6;model_1\/model\/batch_normalization_7\/FusedBatchNormV3;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise;model_1\/model\/depthwise_conv2d_2\/depthwise",
      "blob_weights" : 31,
      "K" : 144,
      "blob_biases" : 29,
      "name" : "model_1\/model\/re_lu_5\/Relu6;model_1\/model\/batch_normalization_7\/FusedBatchNormV3;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise;model_1\/model\/depthwise_conv2d_2\/depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "Relu6__21:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_5\/Relu6;model_1\/model\/batch_normalization_7\/FusedBatchNormV3;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise;model_1\/model\/depthwise_conv2d_2\/depthwise",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__23",
      "top" : "Relu6__23:0",
      "type" : "elementwise",
      "name" : "Relu6__23",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_8\/FusedBatchNormV3;model_1\/model\/conv2d_5\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_8\/FusedBatchNormV3;model_1\/model\/conv2d_5\/Conv2D1",
      "blob_weights" : 35,
      "K" : 144,
      "blob_biases" : 33,
      "name" : "model_1\/model\/batch_normalization_8\/FusedBatchNormV3;model_1\/model\/conv2d_5\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "Relu6__23:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/batch_normalization_8\/FusedBatchNormV3;model_1\/model\/conv2d_5\/Conv2D1,model_1\/model\/batch_normalization_5\/FusedBatchNormV3;model_1\/model\/conv2d_5\/Conv2D;model_1\/model\/conv2d_3\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add\/add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_6\/Relu6;model_1\/model\/batch_normalization_9\/FusedBatchNormV3;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise;model_1\/model\/conv2d_6\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu_6\/Relu6;model_1\/model\/batch_normalization_9\/FusedBatchNormV3;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise;model_1\/model\/conv2d_6\/Conv2D",
      "blob_weights" : 39,
      "K" : 24,
      "blob_biases" : 37,
      "name" : "model_1\/model\/re_lu_6\/Relu6;model_1\/model\/batch_normalization_9\/FusedBatchNormV3;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise;model_1\/model\/conv2d_6\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "model_1\/model\/add\/add",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_6\/Relu6;model_1\/model\/batch_normalization_9\/FusedBatchNormV3;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise;model_1\/model\/conv2d_6\/Conv2D",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__26",
      "top" : "Relu6__26:0",
      "type" : "elementwise",
      "name" : "Relu6__26",
      "beta" : 6
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_7\/Relu6;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 1,
      "top" : "model_1\/model\/re_lu_7\/Relu6;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise",
      "blob_weights" : 43,
      "K" : 144,
      "blob_biases" : 41,
      "stride_x" : 2,
      "name" : "model_1\/model\/re_lu_7\/Relu6;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "Relu6__26:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_7\/Relu6;model_1\/model\/batch_normalization_10\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_3\/depthwise",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__28",
      "top" : "Relu6__28:0",
      "type" : "elementwise",
      "name" : "Relu6__28",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_11\/FusedBatchNormV3;model_1\/model\/conv2d_9\/Conv2D;model_1\/model\/conv2d_7\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_11\/FusedBatchNormV3;model_1\/model\/conv2d_9\/Conv2D;model_1\/model\/conv2d_7\/Conv2D1",
      "blob_weights" : 47,
      "K" : 144,
      "blob_biases" : 45,
      "name" : "model_1\/model\/batch_normalization_11\/FusedBatchNormV3;model_1\/model\/conv2d_9\/Conv2D;model_1\/model\/conv2d_7\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "Relu6__28:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_8\/Relu6;model_1\/model\/batch_normalization_12\/FusedBatchNormV3;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise;model_1\/model\/conv2d_8\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu_8\/Relu6;model_1\/model\/batch_normalization_12\/FusedBatchNormV3;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise;model_1\/model\/conv2d_8\/Conv2D",
      "blob_weights" : 51,
      "K" : 40,
      "blob_biases" : 49,
      "name" : "model_1\/model\/re_lu_8\/Relu6;model_1\/model\/batch_normalization_12\/FusedBatchNormV3;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise;model_1\/model\/conv2d_8\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 240,
      "bottom" : "model_1\/model\/batch_normalization_11\/FusedBatchNormV3;model_1\/model\/conv2d_9\/Conv2D;model_1\/model\/conv2d_7\/Conv2D1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_8\/Relu6;model_1\/model\/batch_normalization_12\/FusedBatchNormV3;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise;model_1\/model\/conv2d_8\/Conv2D",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__31",
      "top" : "Relu6__31:0",
      "type" : "elementwise",
      "name" : "Relu6__31",
      "beta" : 6
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_9\/Relu6;model_1\/model\/batch_normalization_13\/FusedBatchNormV3;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise;model_1\/model\/depthwise_conv2d_4\/depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/re_lu_9\/Relu6;model_1\/model\/batch_normalization_13\/FusedBatchNormV3;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise;model_1\/model\/depthwise_conv2d_4\/depthwise",
      "blob_weights" : 55,
      "K" : 240,
      "blob_biases" : 53,
      "name" : "model_1\/model\/re_lu_9\/Relu6;model_1\/model\/batch_normalization_13\/FusedBatchNormV3;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise;model_1\/model\/depthwise_conv2d_4\/depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 240,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 240,
      "bottom" : "Relu6__31:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_9\/Relu6;model_1\/model\/batch_normalization_13\/FusedBatchNormV3;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise;model_1\/model\/depthwise_conv2d_4\/depthwise",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__33",
      "top" : "Relu6__33:0",
      "type" : "elementwise",
      "name" : "Relu6__33",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_14\/FusedBatchNormV3;model_1\/model\/conv2d_9\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_14\/FusedBatchNormV3;model_1\/model\/conv2d_9\/Conv2D1",
      "blob_weights" : 59,
      "K" : 240,
      "blob_biases" : 57,
      "name" : "model_1\/model\/batch_normalization_14\/FusedBatchNormV3;model_1\/model\/conv2d_9\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "Relu6__33:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/batch_normalization_14\/FusedBatchNormV3;model_1\/model\/conv2d_9\/Conv2D1,model_1\/model\/batch_normalization_11\/FusedBatchNormV3;model_1\/model\/conv2d_9\/Conv2D;model_1\/model\/conv2d_7\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_1\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_1\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_1\/add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_10\/Relu6;model_1\/model\/batch_normalization_15\/FusedBatchNormV3;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise;model_1\/model\/conv2d_10\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu_10\/Relu6;model_1\/model\/batch_normalization_15\/FusedBatchNormV3;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise;model_1\/model\/conv2d_10\/Conv2D",
      "blob_weights" : 63,
      "K" : 40,
      "blob_biases" : 61,
      "name" : "model_1\/model\/re_lu_10\/Relu6;model_1\/model\/batch_normalization_15\/FusedBatchNormV3;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise;model_1\/model\/conv2d_10\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 240,
      "bottom" : "model_1\/model\/add_1\/add",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_10\/Relu6;model_1\/model\/batch_normalization_15\/FusedBatchNormV3;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise;model_1\/model\/conv2d_10\/Conv2D",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__36",
      "top" : "Relu6__36:0",
      "type" : "elementwise",
      "name" : "Relu6__36",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_11\/Relu6;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu_11\/Relu6;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise",
      "blob_weights" : 67,
      "K" : 240,
      "blob_biases" : 65,
      "stride_x" : 2,
      "name" : "model_1\/model\/re_lu_11\/Relu6;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 240,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 240,
      "bottom" : "Relu6__36:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_11\/Relu6;model_1\/model\/batch_normalization_16\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_5\/depthwise",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__38",
      "top" : "Relu6__38:0",
      "type" : "elementwise",
      "name" : "Relu6__38",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_17\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D;model_1\/model\/conv2d_11\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_17\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D;model_1\/model\/conv2d_11\/Conv2D1",
      "blob_weights" : 71,
      "K" : 240,
      "blob_biases" : 69,
      "name" : "model_1\/model\/batch_normalization_17\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D;model_1\/model\/conv2d_11\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "Relu6__38:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_12\/Relu6;model_1\/model\/batch_normalization_18\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/conv2d_12\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu_12\/Relu6;model_1\/model\/batch_normalization_18\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/conv2d_12\/Conv2D",
      "blob_weights" : 75,
      "K" : 80,
      "blob_biases" : 73,
      "name" : "model_1\/model\/re_lu_12\/Relu6;model_1\/model\/batch_normalization_18\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/conv2d_12\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "model_1\/model\/batch_normalization_17\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D;model_1\/model\/conv2d_11\/Conv2D1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_12\/Relu6;model_1\/model\/batch_normalization_18\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/conv2d_12\/Conv2D",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__41",
      "top" : "Relu6__41:0",
      "type" : "elementwise",
      "name" : "Relu6__41",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_13\/Relu6;model_1\/model\/batch_normalization_19\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/depthwise_conv2d_6\/depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "model_1\/model\/re_lu_13\/Relu6;model_1\/model\/batch_normalization_19\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/depthwise_conv2d_6\/depthwise",
      "blob_weights" : 79,
      "K" : 480,
      "blob_biases" : 77,
      "name" : "model_1\/model\/re_lu_13\/Relu6;model_1\/model\/batch_normalization_19\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/depthwise_conv2d_6\/depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 480,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "Relu6__41:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_13\/Relu6;model_1\/model\/batch_normalization_19\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/depthwise_conv2d_6\/depthwise",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__43",
      "top" : "Relu6__43:0",
      "type" : "elementwise",
      "name" : "Relu6__43",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_20\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D;model_1\/model\/conv2d_13\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_20\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D;model_1\/model\/conv2d_13\/Conv2D1",
      "blob_weights" : 83,
      "K" : 480,
      "blob_biases" : 81,
      "name" : "model_1\/model\/batch_normalization_20\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D;model_1\/model\/conv2d_13\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "Relu6__43:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/batch_normalization_20\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D;model_1\/model\/conv2d_13\/Conv2D1,model_1\/model\/batch_normalization_17\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D;model_1\/model\/conv2d_11\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_2\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_2\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_2\/add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_14\/Relu6;model_1\/model\/batch_normalization_21\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/conv2d_14\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu_14\/Relu6;model_1\/model\/batch_normalization_21\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/conv2d_14\/Conv2D",
      "blob_weights" : 87,
      "K" : 80,
      "blob_biases" : 85,
      "name" : "model_1\/model\/re_lu_14\/Relu6;model_1\/model\/batch_normalization_21\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/conv2d_14\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "model_1\/model\/add_2\/add",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_14\/Relu6;model_1\/model\/batch_normalization_21\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/conv2d_14\/Conv2D",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__46",
      "top" : "Relu6__46:0",
      "type" : "elementwise",
      "name" : "Relu6__46",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_15\/Relu6;model_1\/model\/batch_normalization_22\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/depthwise_conv2d_7\/depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "model_1\/model\/re_lu_15\/Relu6;model_1\/model\/batch_normalization_22\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/depthwise_conv2d_7\/depthwise",
      "blob_weights" : 91,
      "K" : 480,
      "blob_biases" : 89,
      "name" : "model_1\/model\/re_lu_15\/Relu6;model_1\/model\/batch_normalization_22\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/depthwise_conv2d_7\/depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 480,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "Relu6__46:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_15\/Relu6;model_1\/model\/batch_normalization_22\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/depthwise_conv2d_7\/depthwise",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__48",
      "top" : "Relu6__48:0",
      "type" : "elementwise",
      "name" : "Relu6__48",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_23\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_23\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D1",
      "blob_weights" : 95,
      "K" : 480,
      "blob_biases" : 93,
      "name" : "model_1\/model\/batch_normalization_23\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "Relu6__48:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/batch_normalization_23\/FusedBatchNormV3;model_1\/model\/conv2d_15\/Conv2D1,model_1\/model\/add_2\/add",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_3\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_3\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_3\/add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_16\/Relu6;model_1\/model\/batch_normalization_24\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/conv2d_16\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu_16\/Relu6;model_1\/model\/batch_normalization_24\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/conv2d_16\/Conv2D",
      "blob_weights" : 99,
      "K" : 80,
      "blob_biases" : 97,
      "name" : "model_1\/model\/re_lu_16\/Relu6;model_1\/model\/batch_normalization_24\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/conv2d_16\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "model_1\/model\/add_3\/add",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_16\/Relu6;model_1\/model\/batch_normalization_24\/FusedBatchNormV3;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise;model_1\/model\/conv2d_16\/Conv2D",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__51",
      "top" : "Relu6__51:0",
      "type" : "elementwise",
      "name" : "Relu6__51",
      "beta" : 6
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_17\/Relu6;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/re_lu_17\/Relu6;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise",
      "blob_weights" : 103,
      "K" : 480,
      "blob_biases" : 101,
      "name" : "model_1\/model\/re_lu_17\/Relu6;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 480,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "Relu6__51:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_17\/Relu6;model_1\/model\/batch_normalization_25\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_8\/depthwise",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__53",
      "top" : "Relu6__53:0",
      "type" : "elementwise",
      "name" : "Relu6__53",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_26\/FusedBatchNormV3;model_1\/model\/conv2d_21\/Conv2D;model_1\/model\/conv2d_17\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_26\/FusedBatchNormV3;model_1\/model\/conv2d_21\/Conv2D;model_1\/model\/conv2d_17\/Conv2D1",
      "blob_weights" : 107,
      "K" : 480,
      "blob_biases" : 105,
      "name" : "model_1\/model\/batch_normalization_26\/FusedBatchNormV3;model_1\/model\/conv2d_21\/Conv2D;model_1\/model\/conv2d_17\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 112,
      "bottom" : "Relu6__53:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_18\/Relu6;model_1\/model\/batch_normalization_27\/FusedBatchNormV3;model_1\/model\/batch_normalization_34\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_11\/depthwise;model_1\/model\/conv2d_18\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu_18\/Relu6;model_1\/model\/batch_normalization_27\/FusedBatchNormV3;model_1\/model\/batch_normalization_34\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_11\/depthwise;model_1\/model\/conv2d_18\/Conv2D",
      "blob_weights" : 111,
      "K" : 112,
      "blob_biases" : 109,
      "name" : "model_1\/model\/re_lu_18\/Relu6;model_1\/model\/batch_normalization_27\/FusedBatchNormV3;model_1\/model\/batch_normalization_34\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_11\/depthwise;model_1\/model\/conv2d_18\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "model_1\/model\/batch_normalization_26\/FusedBatchNormV3;model_1\/model\/conv2d_21\/Conv2D;model_1\/model\/conv2d_17\/Conv2D1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_18\/Relu6;model_1\/model\/batch_normalization_27\/FusedBatchNormV3;model_1\/model\/batch_normalization_34\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_11\/depthwise;model_1\/model\/conv2d_18\/Conv2D",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__56",
      "top" : "Relu6__56:0",
      "type" : "elementwise",
      "name" : "Relu6__56",
      "beta" : 6
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_19\/Relu6;model_1\/model\/batch_normalization_28\/FusedBatchNormV3;model_1\/model\/batch_normalization_34\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_11\/depthwise;model_1\/model\/depthwise_conv2d_9\/depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/re_lu_19\/Relu6;model_1\/model\/batch_normalization_28\/FusedBatchNormV3;model_1\/model\/batch_normalization_34\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_11\/depthwise;model_1\/model\/depthwise_conv2d_9\/depthwise",
      "blob_weights" : 115,
      "K" : 672,
      "blob_biases" : 113,
      "name" : "model_1\/model\/re_lu_19\/Relu6;model_1\/model\/batch_normalization_28\/FusedBatchNormV3;model_1\/model\/batch_normalization_34\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_11\/depthwise;model_1\/model\/depthwise_conv2d_9\/depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 672,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "Relu6__56:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_19\/Relu6;model_1\/model\/batch_normalization_28\/FusedBatchNormV3;model_1\/model\/batch_normalization_34\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_11\/depthwise;model_1\/model\/depthwise_conv2d_9\/depthwise",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__58",
      "top" : "Relu6__58:0",
      "type" : "elementwise",
      "name" : "Relu6__58",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/batch_normalization_29\/FusedBatchNormV3;model_1\/model\/conv2d_21\/Conv2D;model_1\/model\/conv2d_19\/Conv2D1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/batch_normalization_29\/FusedBatchNormV3;model_1\/model\/conv2d_21\/Conv2D;model_1\/model\/conv2d_19\/Conv2D1",
      "blob_weights" : 119,
      "K" : 672,
      "blob_biases" : 117,
      "name" : "model_1\/model\/batch_normalization_29\/FusedBatchNormV3;model_1\/model\/conv2d_21\/Conv2D;model_1\/model\/conv2d_19\/Conv2D1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 112,
      "bottom" : "Relu6__58:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/batch_normalization_29\/FusedBatchNormV3;model_1\/model\/conv2d_21\/Conv2D;model_1\/model\/conv2d_19\/Conv2D1,model_1\/model\/batch_normalization_26\/FusedBatchNormV3;model_1\/model\/conv2d_21\/Conv2D;model_1\/model\/conv2d_17\/Conv2D1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model_1\/model\/add_4\/add",
      "nd_mode" : true,
      "top" : "model_1\/model\/add_4\/add",
      "type" : "elementwise",
      "name" : "model_1\/model\/add_4\/add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_20\/Relu6;model_1\/model\/batch_normalization_30\/FusedBatchNormV3;model_1\/model\/batch_normalization_34\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_11\/depthwise;model_1\/model\/conv2d_20\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/model\/re_lu_20\/Relu6;model_1\/model\/batch_normalization_30\/FusedBatchNormV3;model_1\/model\/batch_normalization_34\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_11\/depthwise;model_1\/model\/conv2d_20\/Conv2D",
      "blob_weights" : 123,
      "K" : 112,
      "blob_biases" : 121,
      "name" : "model_1\/model\/re_lu_20\/Relu6;model_1\/model\/batch_normalization_30\/FusedBatchNormV3;model_1\/model\/batch_normalization_34\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_11\/depthwise;model_1\/model\/conv2d_20\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "model_1\/model\/add_4\/add",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "model_1\/model\/re_lu_20\/Relu6;model_1\/model\/batch_normalization_30\/FusedBatchNormV3;model_1\/model\/batch_normalization_34\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_11\/depthwise;model_1\/model\/conv2d_20\/Conv2D",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Relu6__61",
      "top" : "Relu6__61:0",
      "type" : "elementwise",
      "name" : "Relu6__61",
      "beta" : 6
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "model_1\/model\/re_lu_21\/Relu6;model_1\/model\/batch_normalization_31\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_10\/depthwise;model_1\/model\/depthwise_conv2d_11\/depthwise",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "model_1\/model\/re_lu_21\/Relu6;model_1\/model\/batch_normalization_31\/FusedBatchNormV3;model_1\/model\/depthwise_conv2d_10\/depthwise;model_1\/model\/depthwise_conv2d_11\/depthwise",
      "blob_weights" : 127,
      "K" : 672,
      "blob_biases" : 125,
